Repository: h53d/babylonjs-doc-cn
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Each of these Javascript objects have named 'pockets' to store things-within.&nbsp; Often, values, data, and objects... get stored in those pockets.&nbsp; These value-storing pockets are called object 'properties'.&nbsp; Properties are commonly 'set' (putting a value INTO the pocket), and often 'get' (looking into the pocket to see what's there).
zh_cn: 这些每个 Javascript 对象都有命名的 '存储空间' 来保存内容到里面.&nbsp; 通常是, 值, 数据, 和对象... 被存在这些内存空间里.&nbsp; 这些存储着值的空间被叫做对象的'属性'.&nbsp; 属性通常被 '设置(set)' (将一个值放入存储空间), 和 '获取(get)' (到存储空间查看里面是什么内容).

source: Each of these includes are JavaSCRIPT files, and so they are included-in by using HTML `<SCRIPT>` elements/tags.&nbsp; The shown 'src' (source location) of these files is at the Babylon.js web site folders, but later I will tell you how to put these files on your home hard drive if you wish, and include them from there.&nbsp; They load-in faster when they are 'local', but you will need to change the 'src' URL once you have saved them locally.&nbsp; I will show you how to do that soon.
zh_cn: 每个包含都是 JavaSCRIPT 文件, 所以它们被放在使用 HTML的 `<SCRIPT>` 元素/标签中.&nbsp; 这些文件里显示的 'src' (源码位置) 在 the Babylon.js 网站的文件夹里, 但是稍后我将告诉你如何把这些文件放到你的硬盘驱动器里 - 如果你希望那样做, 然后从那儿包含它们.&nbsp; 当是"本地" 时她们加载会更快, 但是当你将它们保存到本地后你需要修改 'src' 的网址; 我很快会告诉你如何做的.

source: Even though Vector3 values can contain very large negative or positive numbers, it is rarely necessary for any xValue, yValue, or zValue... to be outside the range of -6.28 to +6.28 **for setting rotations**.&nbsp; Any numbers outside that range would be unnecessary, because -6.28 (radians) rotates 360 degrees in one direction, and +6.28 (radians) rotates 360 degrees in the opposite direction.&nbsp; That's a full range of rotation, isn't it?&nbsp; We'll talk a bit more about rotation, further below.
zh_cn: 尽管Vector3的值可以是非常的大正数或负数, 但通常没必要为旋转属性将xValue, yValue, 或 zValue的值设置超出 -6.28 和 +6.28之外的值.&nbsp; 任何这个范围之外的值都没必要, 因为 -6.28 (弧度) 是在一个方向旋转 360 度, 而 +6.28 (弧度) 是在另一个方向旋转 360.&nbsp; 那是可旋转的所有范围, 不是么?&nbsp; 后面我们将在多些讨论旋转.

source: Every key represents the value of the Animation at that key's given time.
zh_cn: 每个键值代表了动画片段在那个时刻的值。

source: Exact values are:
zh_cn: 具体的值会是：

source: Feel free to try different animations on different objects, then come back and learn all about [**Sprites**](http://doc.babylonjs.com/tutorials/Sprites).
zh_cn: 请自己尝试在不同的物体上实现不同的动画, 然后回到这里再学习更多的关于 [**精灵**](http://doc.babylonjs.com/tutorials/Sprites).

source: Finally, you can extend the **EasingFunction** base function to create your own easing function, like this :
zh_cn: 最后, 你能够扩展 **EasingFunction** 基础函数, 从而创造你自己的简化函数,像这样:

source: Finally, you can launch your animation in one line of code, at any time in your application:
zh_cn: 最后，你可以在你应用的任何时间点通过一行代码加载动画。

source: First, create our Animation object:
zh_cn: 首先，创建动画对象：

source: First, do not think of objects as 3D shapes/mesh.&nbsp; Those ARE objects, but here, we are talking about...&nbsp;
zh_cn: 首先,不要把对象认为成 3D造型/网格.&nbsp; 那些事物品对象, 但此处, 我们谈论的事关于...&nbsp;

source: For advanced keyframe animation, you can also define the functions used to interpolate (transition) between keys.
zh_cn: 对于高级的关键帧动画, 你也可以定义个函数实现在键之间插入过度效果.

source: For example, each of the following code lines... creates a Javascript object (or more):
zh_cn: 比如, 下面每行代码... 创建了一个Javascript对象 (或者多个):

source: For purpose, here is a good reference to create your curve algorithm : [http://cubic-bezier.com](http://cubic-bezier.com)
zh_cn: 这特地准备了一个参考来说明如何创建你的曲线算法 : [http://cubic-bezier.com](http://cubic-bezier.com)

source: From Babylon.js version 2.3, you can attach [animation events](http://doc.babylonjs.com/classes/AnimationEvent) to specific frames on an animation.
zh_cn: 从Babylon.js 2.3 版本开始, 你可以附加 [动画事件](http://doc.babylonjs.com/classes/AnimationEvent) 给一个动画的指定帧.

source: Here are the predefined easing functions you can use : - ```BABYLON.CircleEase()``` - ```BABYLON.BackEase(amplitude)``` - ```BABYLON.BounceEase(bounces, bounciness)``` - ```BABYLON.CubicEase()``` - ```BABYLON.ElasticEase(oscillations, springiness)``` - ```BABYLON.ExponentialEase(exponent)``` - ```BABYLON.PowerEase(power)``` - ```BABYLON.QuadraticEase()``` - ```BABYLON.QuarticEase()``` - ```BABYLON.QuinticEase()``` - ```BABYLON.SineEase()```
zh_cn: 这儿是一些你可直接使用的预定义简化函数 : - ```BABYLON.CircleEase()``` - ```BABYLON.BackEase(amplitude)``` - ```BABYLON.BounceEase(bounces, bounciness)``` - ```BABYLON.CubicEase()``` - ```BABYLON.ElasticEase(oscillations, springiness)``` - ```BABYLON.ExponentialEase(exponent)``` - ```BABYLON.PowerEase(power)``` - ```BABYLON.QuadraticEase()``` - ```BABYLON.QuarticEase()``` - ```BABYLON.QuinticEase()``` - ```BABYLON.SineEase()```

source: Here is a pretty cool implementation using the bezier curve algorithm :
zh_cn: 这儿是个非常酷的使用贝塞尔算法的实现 :

source: Here is a straightforward sample to animate a torus within a ```CirleEase``` easing function :
zh_cn: 这儿是个简单的例子, 使用简化函数 ```CirleEase``` 来让椭圆环体动起来的动画 :

source: Here is a straightforward sample using the **CreateAndStartAnimation()** function :
zh_cn: 这有个使用 **CreateAndStartAnimation()** 函数的例子:

source: Here is the fifth HTML SCRIPT element/tag in the big picture scene file.&nbsp; We used 4 SCRIPT elements/tags to do the external includes.&nbsp; This one is an INTERNAL include.&nbsp; Notice that it has no 'src' URL.&nbsp; That is because it is a section of Javascript code that YOU have written directly into this document.&nbsp; Yes, YOU.&nbsp; Now you are a Javascript programmer!
zh_cn: 这是大图片场景文件里的第五个 HTML SCRIPT 元素/标签 .&nbsp; 我们用了4个 SCRIPT 元素/标签 实现外部包含.&nbsp; 这个是内部包含.&nbsp; 注意没有 'src' 地址.&nbsp; 那是因为它是你直接写入这个文档的 Javascript代码部分.&nbsp; 是的, 你写的.&nbsp; 现在你是名 Javascript 程序员!

source: Here we want to scale an object on the X axis, so it will be “scaling.x”.
zh_cn: 此处我们想在X轴方向上放大对象, 所以此处使用“scaling.x”。

source: Here you decide and enter what kind of value will be modified: is it a float (e.g. a translation), a vector (e.g. a direction), or a quaternion.
zh_cn: 此处你决定开始修改什么类型的数据：floating（比如是平移），一个向量(比如是方向)，或四元数。

source: I will talk more about scaling... further below.
zh_cn: 在后面我们会更多的讨论缩放.

source: I would like you to take note... that scaling is **for mesh only**.&nbsp; For example, you can POSITION a mesh, camera, or light.&nbsp; You can often ROTATE a mesh, camera, or light.&nbsp; But SCALING... is for mesh.&nbsp; If you stretch or shrink (scale) a camera or light, you will break its electrical parts.&nbsp; (It's a joke, ok?)&nbsp; &nbsp;There is no reason to set scaling for a camera or light.&nbsp; They are invisible scene items.
zh_cn: 我希望你注意... 缩放是**仅仅网格可以**.&nbsp; 例如, 你可以定位一个网格, 相机, 活着光源.&nbsp; 你可以经常旋转一个网格, 相机, 或者光源.&nbsp; 但是对于缩放... 它是针对网格的.&nbsp; 如果你拉伸或缩小(缩放)一个相机或光源, 你会破坏其电力部分.&nbsp; (开玩笑的,好么?)&nbsp; &nbsp;没有必要缩放相机或光源.&nbsp; 它们是场景中不可见项.

source: If well done, it’s very powerful.
zh_cn: 如果我们做到了, 它将是强大的.

source: If you want more information about easing functions, here are some useful links : - [MSDN Easing functions documentation](http://msdn.microsoft.com/en-us/library/ee308751.aspx) - [Easing functions cheat sheet](http://easings.net/fr)
zh_cn: 如果你希望获得关于简化函数的更多信息,这儿有一些有用的链接 : - [MSDN 简化函数文档](http://msdn.microsoft.com/en-us/library/ee308751.aspx) - [简化函数懒人表单](http://easings.net/fr)

source: If you want to make your home demo scenes run faster, you can download copies of the external includes... and put them into a folder.&nbsp; That folder should be located WITHIN the folder that holds your index.html.&nbsp; For example, in the same folder as index.html, you could create a folder called 'js' (no quotes).&nbsp; Inside the js folder, you could put home copies of The Big 4 external include files.
zh_cn: 如果你想让家里的演示场景运行快些, 你可以下载这些外部文件的拷贝... 然后把它们放入一个文件夹.&nbsp; 该本文件夹必须和你的index.html文件位于同一个文件夹下.&nbsp; 例如, 在index.html的同一文件夹里, 你创建一个叫做'js' (没有引号)的文件夹.&nbsp; 将你下载4大外部资源文件放入该js文件夹.

source: In our case, we want to scale our box, but not in a linear way: it must be faster when it became larger, and slower when it became thinner.
zh_cn: 在我们这个案例，我们想放大盒子，但是不是线性方式，而是放大时盒子越大则放大的速度越快，缩小时盒子越小缩得越慢。

source: In the playground demo below, every time you click on the FPS marker, the new animation is blended with the box's current position:
zh_cn: 在下面这个娱乐展示中, 每次你点击 FPS 标签时, 那个盒子的当前位置会被作为参数重新渲染. :

source: In the yellow text at the top of the scene, you will see the Babylon.js one-line way to set mybox.position (using our friend... the Vector3 value object).
zh_cn: 场景顶部的黄颜色文本, 你将看到一行Bayblon.js代码设置mybox.position的方式 (使用我们的助手... 那个Vector3值对象).

source: Inside the createScene() function (the purple section)... we will be doing the actual Babylon.js commands and directives that cause beautiful webGL to happen.&nbsp; The rest of the big picture sections... are simply helpers and preparations... for the fantastic purple section... the createScene() function.&nbsp; Remember its name, because I will be mentioning it often in many Playpen Series tutorials.&nbsp; It will become your best friend.&nbsp; This I can promise.
zh_cn: 在 createScene() 函数里 (紫色部分)... 我们将开始执行真实的 Babylon.js 指令, 以产生漂亮的WebGL效果出现.&nbsp; 大图片里的剩下部分... 是些简单的辅助和准备工作... 为神奇的紫色部分(那个createScene()函数)服务的.&nbsp; 记住这个函数名, 因为我将在许多游戏练习系列教材里常常提到它.&nbsp; 我能保证,它将成为你最好的支持者.&nbsp

source: It is beyond the scope of this tutorial to teach everything about callable methods and settable properties on Javascript objects.&nbsp; The main thing is to try to take notice WHEN a 'pocket' on an object... is a property, and when it is a method.&nbsp; Methods always use parentheses... sometimes empty, sometimes full of parameters/args.&nbsp; Properties never use parentheses and therefore never require parameters.
zh_cn: 讨论Javascript对象的可调用方法和可设置属性的所有知识点已经超越了本教程的范围.&nbsp; 此处的主要目标是让大家注意到什么情况下'存储空间'里放的是对象的方法，什么情况下是属性; 方法后面总是跟着小括号... 有时括号里面是空的, 有时填满了参数.&nbsp; 属性后面绝不会有括号因此也绝不需要参数.

source: It makes a complicated system, (WebGL,) much easier to use.
zh_cn: Babylon.js构造里一个复杂的系统, 让网页图形库更容易使用.

source: It's very simple to do this: ```javascript // 3 parameters to create an event: // - The frame at which the event will be triggered // - The action to execute // - A boolean if the event should execute only once (false by default) var event1 = new BABYLON.AnimationEvent(50, function() { console.log("Yeah!"); }, true); // Attach your event to your animation animation.addEvent(event1); ```
zh_cn: 这样做非常简单: ```javascript // 用3个参数创建一个事件: // - 触发事件的帧 // - 将执行的动作 // - 一个布尔值表明事件是否仅被执行一次 (默认 否) var event1 = new BABYLON.AnimationEvent(50, function() { console.log("Yeah!"); }, true); // 将你的事件附加到动画上 animation.addEvent(event1); ```

source: Keep in mind that Vector3 values can be negative numbers as well.&nbsp; So you could easily use -Math.PI/4, -Math.PI/2, -Math.PI, and -Math.PI times 2.&nbsp; These values would rotate the object in the opposite direction around the x-axis.&nbsp; How about this Vector3 rotation: ``` javascript box.rotation = new BABYLON.Vector3(Math.PI/2, 0, -.707); ``` If you think that it rotates our box in a positive (+) direction 90 degrees around the x-axis, AND ALSO rotates our box 45 degrees in a negative (-) direction around the z-axis, you would be correct.&nbsp;
zh_cn: 记住Vector3点值也能为负数.&nbsp; 因此你可以使用 -Math.PI/4, -Math.PI/2, -Math.PI, 和 -Math.PI乘以2.&nbsp; 这些值将是绕着X轴向相反方向旋转.&nbsp; 这个Vector3如何旋转呢: ``` javascript box.rotation = new BABYLON.Vector3(Math.PI/2, 0, -.707); ``` 如果你是这样想的就对了:将盒子绕着X轴旋转正的90度, 而且也绕着Z轴旋转负的45度.&nbsp;

source: Let's pretend that you have been working on a scene file at home, and after many tries, you just cannot get it to work properly.&nbsp; You could copy your home createScene function, then visit the playground, press its **CLEAR** button to empty its editor window, and then paste YOUR createScene function into the editor.
zh_cn: 让我们假设,你在一直在家中创建了一个场景文件, 经过多次尝试, 它就是不能正常工作.&nbsp; 你可以复制你家里的 createScene 函数, 然后访问娱乐展示厅, 点击 **清除** 按钮 来清空编辑窗口, 最后把你的 createScene 函数粘贴到编辑区域里.

source: Let's take a look at a playground scene that I once created and saved.&nbsp; In this demo, I made those invisible rods... be visible:
zh_cn: 让我们看看娱乐展示厅里的一个我曾经创建保存的场景.&nbsp; 在这个演示里, 我将这些无形的棒可视化了:

source: Maybe now you want to build an Animation for box1.scaling.y, and really get box1 moving playfully.
zh_cn: 现在你也许希望在y轴上缩放box1, 而且实时移动box1.

source: Most important, though, is the Babylon.js framework, our pride and joy.
zh_cn: 最重要是 Babylon.js 框架, 我们的骄傲与荣幸.

source: Much information is in the parameters:
zh_cn: 更多信息在参数里：

source: Next, two important steps: * Adding the animation array to the animation object:
zh_cn: 紧接着，最重要的两步： * 将存有动画信息的数组添加到动画对象上。

source: Notice the button that is currently labeled **Basic Scene**.&nbsp; (It is actually called the Scene Selector button, but it is currently LABELED 'Basic Scene')
zh_cn: 注意当前标注了 **基础场景**的按钮.&nbsp; (实际上它叫做场景选择按钮, 只是当前标上了'基础场景').

source: Now for the good stuff.&nbsp; Every createScene() (every scene)... in Babylon.js... generally REQUIRES three things.
zh_cn: 现在来讲干货stuff.&nbsp; 在Babylon.js里每次 createScene()调用 (也就是每个场景)通常需要三件事情:

source: Now let's look at a Vector3 being used to set a .rotation value:
zh_cn: 现在让我们可个使用Vector3来设置旋转值的例子:

source: Now let's see a Vector3 used for scaling (stretching and shrinking) a mesh:
zh_cn: 现在让我看看使用Vector3设置缩放(拉伸和缩减)一个网格:

source: Now that we have our Animation object, it is time to say how those values will be modified.
zh_cn: 现在我们已经有动画对象了，可以谈论如何修改那些值了。

source: Now you can bookmark that unique URL, and then visit the Babylon.js forum at:
zh_cn: 现在你可以用书签纪录下那个唯一的网址, 然后去访问 Babylon.js 论坛:

source: Objects are everywhere, but they are good friends that help us stay organized.
zh_cn: 对象无处不在, 然而它是我们组织管理存储内容的好助手.

source: Once you have that folder made, you can use the 4 links shown below... to get copies of The Big 4... and put each of them into your js folder.
zh_cn: 一旦你准备好那个文件夹, 你可以使用下面显示的4个链接... 获取4大资源拷贝... 然后将它们各自放入你的文件夹.

source: Once you have those external includes saved into your new js folder, you need to make some adjustments to the HTML.&nbsp; In your index.html file, you will need to change the .src attributes of all four external includes (the first four SCRIPT elements).&nbsp; Likely, you will want to make your SCRIPT elements look like this: ``` html &nbsp;&nbsp; &nbsp; <script src="./js/hand.minified-1.2.js"></script> &nbsp;&nbsp; &nbsp; <script src="./js/cannon.js"></script>&nbsp; <!-- optional --> &nbsp;&nbsp; &nbsp; <script src="./js/oimo.js"></script>&nbsp; <!-- optional --> &nbsp;&nbsp; &nbsp; <script src="./js/babylon.js"></script> ``` If you are not using physics in your scene, you might want to remark-out (disable) the script elements that include-in cannon.js and oimo.js.&nbsp; To do that, you could do this: ``` html &nbsp;&nbsp; &nbsp; <script src="./js/hand.minified-1.2.js"></script> &nbsp;&nbsp; &nbsp; <!-- <script src="./js/cannon.js"></script> --> &nbsp;&nbsp; &nbsp; <!-- <script src="./js/oimo.js"></script> --> &nbsp;&nbsp; &nbsp; <script src="./js/babylon.js"></script> ``` Easy.&nbsp; Most of these things you already know, don't you?&nbsp; I thought so.
zh_cn: 一旦你将那些外部资源保存到你的新js文件夹, 你就需要调整下你的页面HTML内容.&nbsp; 在你的index.html文件里, 你需要改变4个外部包含(那4个SCRIPT元素)的.src属性内容.&nbsp; 可能, 你想让你的SCRIPT元素看起来像这样子: ``` html &nbsp;&nbsp; &nbsp; <script src="./js/hand.minified-1.2.js"></script> &nbsp;&nbsp; &nbsp; <script src="./js/cannon.js"></script>&nbsp; <!-- 可选项 --> &nbsp;&nbsp; &nbsp; <script src="./js/oimo.js"></script>&nbsp; <!-- 可选项 --> &nbsp;&nbsp; &nbsp; <script src="./js/babylon.js"></script> ``` 如果你在场景里不使用物理特性, 你可能会标注掉(禁用)包含cannon.js 和 oimo.js脚本的元素 .&nbsp; 为了实现它, 你可以这样做: ``` html &nbsp;&nbsp; &nbsp; <script src="./js/hand.minified-1.2.js"></script> &nbsp;&nbsp; &nbsp; <!-- <script src="./js/cannon.js"></script> --> &nbsp;&nbsp; &nbsp; <!-- <script src="./js/oimo.js"></script> --> &nbsp;&nbsp; &nbsp; <script src="./js/babylon.js"></script> ``` 简单吧.&nbsp; 大部分内容你都已经知道了, 难道你还没么?&nbsp; 我想你会了.

source: One of the many properties on a StandardMaterial object... is named .diffuseColor.&nbsp; That property is the primary way to set a basic color.&nbsp; And right here... is where we use our new Color3 value.&nbsp; Let's have a look: ``` javascript myMaterial.diffuseColor = new BABYLON.Color3(0, 0.5, 0); ``` Our box is now colored medium green.&nbsp; It's just that easy.&nbsp; The StandardMaterial object has many other properties on it.&nbsp; You can add color to properties such as&nbsp; .specularColor, .emissiveColor, .ambientColor.&nbsp; All those properties are set (if you choose)... using our friend... the Babylon.js Color3 value.
zh_cn: 在标准材质对象的众多属性中,有个叫作漫反射颜色(.diffuseColor).&nbsp; 那个属性是设置基础颜色的主要途径.&nbsp; 此处... 我们使用新分配的 Color3值来设置.&nbsp; 让们看看代码: ``` javascript myMaterial.diffuseColor = new BABYLON.Color3(0, 0.5, 0); ` 我们的盒子现在是种绿色了.&nbsp; 就是那么简单.&nbsp; 标准材质对象有许多其它的属性.&nbsp; 你可以给诸如&nbsp;镜面光颜色( .specularColor), 放射光颜色(.emissiveColor), 环境光颜色(.ambientColor)等属性天假颜色.&nbsp; 所有这些属性都使用(如果你选择这样做)Babylon.js的三元色(Color3)值来设置.

source: Our goal: move this “box1”.
zh_cn: 我们的目标是：移动这个"box1"。

source: Press the playground's **RUN** button and see if it works.&nbsp; If it does not work, you can do some changes in the editor window, and hit **RUN** again... and again, and again.&nbsp; Experiment with it there, and if you still cannot get it to work, you can press the **SAVE** button.&nbsp; When you do that, the playground will give your scene a unique URL.&nbsp; It will look something like this:
zh_cn: 按下娱乐展示厅的**运行**按钮,看看它是否有效.&nbsp; 如果不正常, 你可以在编辑窗口里做些修改, 然后再次点击 **运行** ... 如此不断调整.&nbsp; 尝试下, 如果你你仍然不能使它有效运行, 你可以按下 **保存** 按钮.&nbsp; 之后会为你的场景生成一个唯一的网址.&nbsp; 看起来就像这个样子:

source: Properties store values.&nbsp; These values are used by the Babylon.js framework... to 'render' the scene.&nbsp; Here is an example:
zh_cn: 属性是存储着的值.&nbsp; 这些纸被Babylon.js框架使用... 用于 '渲染(render)' 场景.&nbsp; 这是个例子:

source: Remember 'The Big Picture' far above?&nbsp; In that section, I introduced you to 'The Big 4' external include files...&nbsp; hand.js, cannon.js, oimo.js, and babylon.js.&nbsp; Many people use GitHub version-management systems to download those files from the Babylon.js GitHub source code repository.&nbsp; Some people make their own 'minified' versions of Babylon.js... using the absolute latest source code files.&nbsp; Others like to be able to grab reasonably fresh versions of The Big 4... in simpler ways.
zh_cn: 还记得上面的'大图片'么?&nbsp; 在那个段中, 我给你介绍了包含的'四大'外部文件资源...&nbsp; hand.js, cannon.js, oimo.js, 和 babylon.js.&nbsp; 许多人通过GitHub版本管理系统从Babylon.js的GitHub源代码仓库下载这些文件.&nbsp; 有些人使用最新的源代码文件创建自己的 '缩小'版Babylon.js&nbsp; 其他人则喜欢通过网络抓取的简单方式获取合适的新版四大文件资源.

source: See the 'createScene' function in the left-side code editing window?&nbsp; Does it look familiar?&nbsp; It is the very same code from the purple section of the big picture (but with a couple of word-wrapped lines).&nbsp; Now you can see why the createScene function is an important section.&nbsp; It is somewhat portable.&nbsp; You can copy createScene functions to/from the playground editor, and to/from your home scene files.
zh_cn: 看到左边代码窗口里的 'createScene' 函数里么?&nbsp; 看起来熟悉吧?&nbsp; 它是和大图片里的紫色部分非常像的代码(只是多了些换行).&nbsp; 现在你该清楚了为什么那个 createScene 函数是一个重要的部分.&nbsp; 它是有一定可移植性的.&nbsp; 你能够在 createScene 函数和你本地的场景文件之间将代码拷来拷去.

source: So:
zh_cn: 如此:

source: Some of the common Javascript objects used in a Babylon.js scene... are named **engine, scene, canvas, mesh, light, camera, Vector3, Color3, ActionManager, and Animation**.&nbsp;
zh_cn: Javascript 对象里的一些常见对象在 Babylon.js 场景里有使用... 它们叫做 **引擎(engine), 场景(scene), 花布(canvas), 网格(mesh), 灯光(light), 相机(camera), 三元向量(Vector3), 三元颜色(Color3), 动作管理器(ActionManager), 和动画(Animation)**.&nbsp;

source: Someday, you may want to 'externalize' these styles by placing them in a separate file, possibly called styles.css.&nbsp; Then you could remove the blue section from this HTML file, and use a HTML LINK element/tag to include-in that separate CSS style document.&nbsp; I will not be telling you how to do that, but there are plenty of documents on the web that will show you how.&nbsp; It is very easy.
zh_cn: 有一天, 你希望通过把这些样式内容放在单独的文件里使它们外部化, 也许可以把文件叫做 styles.css.&nbsp; 那是可以把蓝色部分从这个HTML文件里移除掉, 然后使用HTML LINK元素/标签把样式文件放到里面.&nbsp; 我不回教你怎么做那个, 但是网上满是文档教你如何做的; 它非常简单.

source: Sometimes, methods are used to SET values of properties, and sometimes methods are used to GET values of properties.&nbsp; These methods/functions are often called GETTERS and SETTERS.&nbsp; Notice the word 'get' in the getMeshByName method above?&nbsp; It is a GETTER method.&nbsp; Here is a more proper use of that 'call':
zh_cn: 有时候, 方法被用来设置属性值， 有时后别用来获取属性值.&nbsp; 这些方法/函数通常被称为 GETTERS 和 SETTERS.&nbsp; 注意到上面getMeshByName方法里的用词 'get' 没?&nbsp; 它就是个 GETTER 方法.&nbsp; 这儿又是一个该方法调用':

source: Store each of those files into the new js folder.&nbsp; Also, you might want to copy them to some other folder as well, for using later.&nbsp; Try to remember to repeat these actions fairly often, maybe once per month, to ensure that you are always using a reasonably fresh version of The Big 4 files.&nbsp; Babylon.js is always evolving.&nbsp; New features are being added very quickly, and you want your home versions of The Big 4... to be fresh, so you can take advantage of those new features.
zh_cn: 将这些文件保存到新的js文件夹.&nbsp; 此外, 你也许想拷贝它们到其它文件夹, 以便以后使用.&nbsp; 尽量经常重复这些动作, 也许每月一次的好, 以确保你使用的4大文件资源总是最新的版本.&nbsp; Babylon.js一直在持续进化.&nbsp; 新特性的添加非常快, 你想家里的4大资源文件版本保持新的, 以便利用这些新特性, 因此你就要经常重复上面的动作.

source: Take some time to carefully watch that scene.&nbsp; Like the last demo scene, the yellow text shows a Vector3 being used to set the .rotation property with some computer-generated values.&nbsp; The box is shown doing positive and negative rotations around each of the 3 axes.&nbsp; Under the yellow text... you again see the green text...&nbsp; showing the 3 'discrete' ways to set the box's .rotation property with values.&nbsp; I bet you understand this completely, don't you?&nbsp; Easy.
zh_cn: 花些时间仔细观察下这个场景.&nbsp; 更上个演示场景类似, 黄颜色文本显示了一个Vector3量, 它被一些电脑生成的值填充并被用来设置旋转属性(.rotation).&nbsp; 盒子展示着绕3个轴各自独立正转反转的情形.&nbsp; 在黄颜色文本下面... 你再次看到绿颜色文本...&nbsp; 展示着3种 '零散'方式给盒子的旋转属性(.rotation)设置值.&nbsp; 我打赌你已经完全理解了, 难道你们么??&nbsp; 就是如此简单.

source: That is a BIG picture, isn't it?&nbsp; This is a complete Babylon.js scene, using the 'single HTML file' method.&nbsp; This is not the only (or best) method of setting up a scene, but it is fast and easy.&nbsp; I have colored important sections of 'the big picture' and we will now examine each section individually.
zh_cn: 它是个大图片,不是么? &nbsp; 这是个完整的 Babylon.js 场景, 使用 '简单的 HTML 文件' 的方法.&nbsp; 这不是唯一(也不是最好)的设置一个场景的方法, 但是快速而简单.&nbsp; 我已经在"大图片上"的重要段上标色,而且我们现在就一段段段查看.

source: The JS code you see inside the green section... will be talked about soon.&nbsp; Mainly, I would like you to study the big picture, and see how the single HTML file method of creating Babylon.js scenes... is structured.&nbsp; I want you to try to visualize and somewhat memorize... this scene file's 'layout'.
zh_cn: 你看到的在绿色部分里的 JS 代码... 很快会被讨论到.&nbsp; 我主要是希望你学习下大图片里的内容, 而且弄明白单个HTML文件里的Babylon.js场景是如何创建的.&nbsp; 对这个文件的格式, 我希望你能够尽力留下印象且记得一点点.

source: The ```BABYLON.Animatable``` object also supports the following functions: - ```pause()``` - ```restart()``` - ```stop()``` - ```reset()```
zh_cn: 该 ```BABYLON.Animatable``` 对象也支持下列函数: - ```pause()``` - ```restart()``` - ```stop()``` - ```reset()```

source: The animation is based on objects called Animation (!!).
zh_cn: 基于众多物体对象动画也叫电影片段。

source: The code computed at run time must be located in this function: ```javascript scene.registerBeforeRender(function () {
zh_cn: 运行时的计算代码必须位于这个函数内: ```javascript scene.registerBeforeRender(function () {

source: The complex animation lets you choose everything at each frame of the animation (each tick).
zh_cn: 复杂动画允许你选择每帧的每样东西(每一瞬间).

source: The first external include is hand.minified-1.2.js (often simply called hand.js) - a small Javascript framework that assists the Babylon.js cameras.
zh_cn: 第一个从外部包含的是 hand.minified-1.2.js (通常简称为hand.js) - 一个用来辅助Babylon.js相机的小Javascript框架.
